app/controllers/shorturls_controller.rb

  def create
    if !params[:long_url].blank?
      regx = /^(http|https):\/\/[a-z0-9]+([\-\.]{1}[a-z0-9]+)*\.[a-z]{2,5}(:[0-9]{1,5})?(\/.*)?$/ix
    if  (params[:long_url] =~ regx)
      @shorturl = Shorturl.new
      client = Bitly.client
      @url = client.shorten(params[:long_url])

      @shorturl.long_url = params[:long_url]
      @shorturl.short_url=@url.short_url
      @shorturl.save
---
INSERT INTO "shorturls" ("long_url", "short_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["long_url", "https://google.com"], ["short_url", "http://bit.ly/1GNLwtv"], ["created_at", "2015-06-18 09:06:23.641964"], ["updated_at", "2015-06-18 09:06:23.641964"]]

  def index
    @shorturls = Shorturl.all
---
SELECT "shorturls".* FROM "shorturls"